Revit 2027 API
BuiltInFailures.OverlapFailures.DivisionSketchOverlap Property
 Curves in the sketch of the Division overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivisionSketchOverlap { get; }
Public Shared ReadOnly Property DivisionSketchOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivisionSketchOverlap {
	FailureDefinitionId^ get ();
}
static member DivisionSketchOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace